  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-firewall` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/b5382921-4cd9-4abc-b4c2-ccdd5f6d057a/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.sites["eastus2"].azurerm_route_table.for_every_subnet_but_vnet_gw will be created
+ resource "azurerm_route_table" "for_every_subnet_but_vnet_gw" {
    + disable_bgp_route_propagation = false
    + id                            = (known after apply)
    + location                      = "eastus2"
    + name                          = "for-every-subnet-but-vnet-gw-eastus2"
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + route                         = [
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "local-vnet-no-firewall"
            + next_hop_in_ip_address = ""
            + next_hop_type          = "VnetLocal"
          },
        + {
            + address_prefix         = "10.0.0.0/8"
            + name                   = "10-8-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
        + {
            + address_prefix         = "172.16.0.0/12"
            + name                   = "172-16-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
        + {
            + address_prefix         = "192.168.0.0/24"
            + name                   = "192-168-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
      ]
    + subnets                       = (known after apply)
  }

# module.sites["eastus2"].azurerm_route_table.for_vnet_gw will be created
+ resource "azurerm_route_table" "for_vnet_gw" {
    + disable_bgp_route_propagation = false
    + id                            = (known after apply)
    + location                      = "eastus2"
    + name                          = "for-vnet-gw-eastus2"
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + route                         = [
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "local-vnet-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
      ]
    + subnets                       = (known after apply)
  }

# module.sites["eastus2"].azurerm_subnet_route_table_association.for_every_subnet_but_vnet_gw[0] will be created
+ resource "azurerm_subnet_route_table_association" "for_every_subnet_but_vnet_gw" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/VmSubnet"
  }

# module.sites["eastus2"].azurerm_subnet_route_table_association.for_vnet_gw[0] will be created
+ resource "azurerm_subnet_route_table_association" "for_vnet_gw" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/GatewaySubnet"
  }

# module.sites["westus2"].azurerm_route_table.for_every_subnet_but_vnet_gw will be created
+ resource "azurerm_route_table" "for_every_subnet_but_vnet_gw" {
    + disable_bgp_route_propagation = false
    + id                            = (known after apply)
    + location                      = "westus2"
    + name                          = "for-every-subnet-but-vnet-gw-westus2"
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + route                         = [
        + {
            + address_prefix         = "10.0.0.0/8"
            + name                   = "10-8-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
        + {
            + address_prefix         = "10.1.0.0/16"
            + name                   = "local-vnet-no-firewall"
            + next_hop_in_ip_address = ""
            + next_hop_type          = "VnetLocal"
          },
        + {
            + address_prefix         = "172.16.0.0/12"
            + name                   = "172-16-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
        + {
            + address_prefix         = "192.168.0.0/24"
            + name                   = "192-168-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
      ]
    + subnets                       = (known after apply)
  }

# module.sites["westus2"].azurerm_route_table.for_vnet_gw will be created
+ resource "azurerm_route_table" "for_vnet_gw" {
    + disable_bgp_route_propagation = false
    + id                            = (known after apply)
    + location                      = "westus2"
    + name                          = "for-vnet-gw-westus2"
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + route                         = [
        + {
            + address_prefix         = "10.1.0.0/16"
            + name                   = "local-vnet-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
      ]
    + subnets                       = (known after apply)
  }

Plan: 6 to add, 0 to change, 0 to destroy.
module.sites["westus2"].azurerm_route_table.for_vnet_gw: Creating...
module.sites["westus2"].azurerm_route_table.for_every_subnet_but_vnet_gw: Creating...
module.sites["eastus2"].azurerm_route_table.for_every_subnet_but_vnet_gw: Creating...
module.sites["eastus2"].azurerm_route_table.for_vnet_gw: Creating...
module.sites["westus2"].azurerm_route_table.for_every_subnet_but_vnet_gw: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/for-every-subnet-but-vnet-gw-westus2]
module.sites["westus2"].azurerm_route_table.for_vnet_gw: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/for-vnet-gw-westus2]
module.sites["eastus2"].azurerm_route_table.for_vnet_gw: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/for-vnet-gw-eastus2]
module.sites["eastus2"].azurerm_subnet_route_table_association.for_vnet_gw[0]: Creating...
module.sites["eastus2"].azurerm_route_table.for_every_subnet_but_vnet_gw: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/for-every-subnet-but-vnet-gw-eastus2]
module.sites["eastus2"].azurerm_subnet_route_table_association.for_every_subnet_but_vnet_gw[0]: Creating...
module.sites["eastus2"].azurerm_subnet_route_table_association.for_vnet_gw[0]: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/GatewaySubnet]
module.sites["eastus2"].azurerm_subnet_route_table_association.for_every_subnet_but_vnet_gw[0]: Still creating... [11s elapsed]
module.sites["eastus2"].azurerm_subnet_route_table_association.for_every_subnet_but_vnet_gw[0]: Creation complete after 12s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/VmSubnet]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.
```

  </details>